# SetLayoutFixedNumber Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..SetLayoutFixedNumber Method
SpacingRule Class See Also
---
Set the Layout property to FixedNumber.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetLayoutFixedNumber(
	int number,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
```

Visual Basic
---
```text
Public Sub SetLayoutFixedNumber ( _
	number As Integer, _
	just As SpacingRuleJustification, _
	gridlinesRotation As Double, _
	offset As Double _
)
```

Visual C++
---
```text
public:
void SetLayoutFixedNumber(
	int number,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
```

# ### Parameters
number
    Type: System..::..Int32
just
    Type: Autodesk.Revit.DB..::..SpacingRuleJustification
gridlinesRotation
    Type: System..::..Double
offset
    Type: System..::..Double
# Remarks
When changing the Layout to FixedNumber, you must also simultaneously set the Number, Justification, GridlinesRotation, and Offset properties.
# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace